{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "arguments": {}, "trainable": true, "output_shape": null, "name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0092\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_col": 5, "b_regularizer": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "nb_filter": 24, "bias": true, "nb_row": 5, "trainable": true, "init": "glorot_uniform", "name": "convolution2d_1", "dim_ordering": "tf", "border_mode": "valid", "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_col": 5, "b_regularizer": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "nb_filter": 36, "bias": true, "nb_row": 5, "trainable": true, "init": "glorot_uniform", "name": "convolution2d_2", "dim_ordering": "tf", "border_mode": "valid", "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_col": 5, "b_regularizer": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "nb_filter": 48, "bias": true, "nb_row": 5, "trainable": true, "init": "glorot_uniform", "name": "convolution2d_3", "dim_ordering": "tf", "border_mode": "valid", "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "nb_filter": 64, "bias": true, "nb_row": 3, "trainable": true, "init": "glorot_uniform", "name": "convolution2d_4", "dim_ordering": "tf", "border_mode": "valid", "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "nb_filter": 64, "bias": true, "nb_row": 3, "trainable": true, "init": "glorot_uniform", "name": "convolution2d_5", "dim_ordering": "tf", "border_mode": "valid", "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "activity_regularizer": null, "input_dim": 64, "output_dim": 80, "init": "glorot_uniform", "name": "dense_1", "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "activity_regularizer": null, "input_dim": 80, "output_dim": 40, "init": "glorot_uniform", "name": "dense_2", "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "activity_regularizer": null, "input_dim": 40, "output_dim": 20, "init": "glorot_uniform", "name": "dense_3", "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "activity_regularizer": null, "input_dim": 20, "output_dim": 10, "init": "glorot_uniform", "name": "dense_4", "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "activity_regularizer": null, "input_dim": 10, "output_dim": 1, "init": "glorot_uniform", "name": "dense_5", "b_constraint": null}}]}